Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.bedrock_security.google_cloud_run_service.bigquery_crawler will be created
+ resource "google_cloud_run_service" "bigquery_crawler" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "bedrock-9decd0-bigquery-crawler"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"     = "10"
                  + "autoscaling.knative.dev/minScale"     = "0"
                  + "run.googleapis.com/startup-cpu-boost" = "false"
                  + "run.googleapis.com/startupProbeType"  = "Default"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 1
              + service_account_name  = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 599

              + containers {
                  + image = "gcr.io/symmetric-flag-392720/gcp_crawler_test"
                  + name  = (known after apply)

                  + env {
                      + name  = "CRAWL_CLOUD"
                      + value = "gcp"
                    }
                  + env {
                      + name  = "CRAWL_DATABASE_TABLE"
                      + value = "bq"
                    }
                  + env {
                      + name  = "CRAWL_GCP_AWS_HAWKEYE_ROLE_ARN"
                      + value = "arn:aws:iam::372065445367:role/bedrock-aws-role-gcp-gcptestcust1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_ID"
                      + value = "bedrock-9decd0-classification-work-queue"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_TASK_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CRAWL_GCP_DYN_PATH_TABLE"
                      + value = "gcptestcust1-pth-table"
                    }
                  + env {
                      + name  = "CRAWL_GCP_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_ID"
                      + value = "bedrock-9decd0-bigquery-crawler-work-queue"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "256Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.bedrock_security.google_cloud_run_service.classification will be created
+ resource "google_cloud_run_service" "classification" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "bedrock-9decd0-classification"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"     = "1000"
                  + "autoscaling.knative.dev/minScale"     = "0"
                  + "run.googleapis.com/startup-cpu-boost" = "false"
                  + "run.googleapis.com/startupProbeType"  = "Default"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 1
              + service_account_name  = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 599

              + containers {
                  + image = "gcr.io/symmetric-flag-392720/gcp-classification"
                  + name  = (known after apply)

                  + env {
                      + name  = "AWS_DEFAULT_REGION"
                      + value = "us-west-2"
                    }
                  + env {
                      + name  = "AWS_ROLE_ARN"
                      + value = "arn:aws:iam::372065445367:role/bedrock-aws-role-gcp-gcptestcust1"
                    }
                  + env {
                      + name  = "OUTPUT_BUCKET"
                      + value = "e4d91e50-dc06-4f35-9081-38b21c3af242-us-west-2"
                    }
                  + env {
                      + name  = "OUTPUT_PREFIX"
                      + value = "gcptestcust1"
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "2Gi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.bedrock_security.google_cloud_run_service.cloudsql_crawler will be created
+ resource "google_cloud_run_service" "cloudsql_crawler" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "bedrock-9decd0-cloudsql-crawler"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"     = "10"
                  + "autoscaling.knative.dev/minScale"     = "0"
                  + "run.googleapis.com/startup-cpu-boost" = "false"
                  + "run.googleapis.com/startupProbeType"  = "Default"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 1
              + service_account_name  = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 599

              + containers {
                  + image = "gcr.io/symmetric-flag-392720/gcp_crawler_test"
                  + name  = (known after apply)

                  + env {
                      + name  = "CRAWL_CLOUD"
                      + value = "gcp"
                    }
                  + env {
                      + name  = "CRAWL_DATABASE_TABLE"
                      + value = "cloudsql"
                    }
                  + env {
                      + name  = "CRAWL_GCP_AWS_HAWKEYE_ROLE_ARN"
                      + value = "arn:aws:iam::372065445367:role/bedrock-aws-role-gcp-gcptestcust1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_ID"
                      + value = "bedrock-9decd0-classification-work-queue"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_TASK_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CRAWL_GCP_DYN_PATH_TABLE"
                      + value = "gcptestcust1-pth-table"
                    }
                  + env {
                      + name  = "CRAWL_GCP_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_ID"
                      + value = "bedrock-9decd0-cloudsql-crawler-work-queue"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "256Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.bedrock_security.google_cloud_run_service.gcs_crawler will be created
+ resource "google_cloud_run_service" "gcs_crawler" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "bedrock-9decd0-gcs-crawler"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"     = "250"
                  + "autoscaling.knative.dev/minScale"     = "0"
                  + "run.googleapis.com/startup-cpu-boost" = "false"
                  + "run.googleapis.com/startupProbeType"  = "Default"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 1
              + service_account_name  = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 599

              + containers {
                  + image = "gcr.io/symmetric-flag-392720/gcp_crawler_test"
                  + name  = (known after apply)

                  + env {
                      + name  = "CRAWL_CLOUD"
                      + value = "gcp"
                    }
                  + env {
                      + name  = "CRAWL_DATA_STORE"
                      + value = "gcs"
                    }
                  + env {
                      + name  = "CRAWL_GCP_AWS_HAWKEYE_ROLE_ARN"
                      + value = "arn:aws:iam::372065445367:role/bedrock-aws-role-gcp-gcptestcust1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_ID"
                      + value = "bedrock-9decd0-classification-work-queue"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_TASK_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CRAWL_GCP_DYN_PATH_TABLE"
                      + value = "gcptestcust1-pth-table"
                    }
                  + env {
                      + name  = "CRAWL_GCP_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_ID"
                      + value = "bedrock-9decd0-gcs-crawler-work-queue"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "256Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.bedrock_security.google_cloud_run_service.scheduler will be created
+ resource "google_cloud_run_service" "scheduler" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "bedrock-9decd0-bedrock-scheduler"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"     = "10"
                  + "autoscaling.knative.dev/minScale"     = "0"
                  + "run.googleapis.com/startup-cpu-boost" = "false"
                  + "run.googleapis.com/startupProbeType"  = "Default"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 1
              + service_account_name  = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 599

              + containers {
                  + image = "gcr.io/symmetric-flag-392720/gcp_scheduler_test"
                  + name  = (known after apply)

                  + env {
                      + name  = "SCHED_CLOUD"
                      + value = "gcp"
                    }
                  + env {
                      + name  = "SCHED_GCP_AWS_HAWKEYE_ROLE_ARN"
                      + value = "arn:aws:iam::372065445367:role/bedrock-aws-role-gcp-gcptestcust1"
                    }
                  + env {
                      + name  = "SCHED_GCP_CLASS_CLOUD_RUN_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_GCP_CLASS_CLOUD_RUN_NAME"
                      + value = "bedrock-9decd0-classification"
                    }
                  + env {
                      + name  = "SCHED_GCP_CLASS_CLOUD_RUN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_GCP_CLOUD_RUN_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_GCP_CLOUD_RUN_NAME"
                      + value = "bedrock-9decd0-bedrock-scheduler"
                    }
                  + env {
                      + name  = "SCHED_GCP_CLOUD_RUN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_GCP_DYN_PLATFORM_TABLE_NAME"
                      + value = "gcptestcust1-sched-platform-table"
                    }
                  + env {
                      + name  = "SCHED_GCP_DYN_SCAN_TABLE_NAME"
                      + value = "gcptestcust1-sched-platform-table"
                    }
                  + env {
                      + name  = "SCHED_GCP_ENABLE_CONFIG_UPDATE"
                      + value = "true"
                    }
                  + env {
                      + name  = "SCHED_GCP_ENABLE_PLATFORM_BIGQUERY"
                      + value = "false"
                    }
                  + env {
                      + name  = "SCHED_GCP_ENABLE_PLATFORM_CLOUDSQL"
                      + value = "true"
                    }
                  + env {
                      + name  = "SCHED_GCP_ENABLE_PLATFORM_GCS"
                      + value = "true"
                    }
                  + env {
                      + name  = "SCHED_GCP_ENABLE_PLATFORM_SNOWFLAKE"
                      + value = "false"
                    }
                  + env {
                      + name  = "SCHED_GCP_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_GCP_WORK_QUEUE_ID"
                      + value = "bedrock-9decd0-scheduler-queue"
                    }
                  + env {
                      + name  = "SCHED_GCP_WORK_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_GCP_WORK_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_GCP_WORK_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_CLOUD_RUN_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_CLOUD_RUN_NAME"
                      + value = "bedrock-9decd0-bigquery-crawler"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_CLOUD_RUN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_DEFAULT_POLICY_ENABLED"
                      + value = "false"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_SCAN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_WORK_QUEUE_ID"
                      + value = "bedrock-9decd0-bigquery-crawler-work-queue"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_WORK_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_WORK_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_WORK_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_BIGQUERY_WORK_QUEUE_TASK_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_CLOUD_RUN_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_CLOUD_RUN_NAME"
                      + value = "bedrock-9decd0-cloudsql-crawler"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_CLOUD_RUN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_DEFAULT_POLICY_ENABLED"
                      + value = "true"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_DEFAULT_POLICY_PERIOD_SECS"
                      + value = "16070400"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_SCAN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_WORK_QUEUE_ID"
                      + value = "bedrock-9decd0-cloudsql-crawler-work-queue"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_WORK_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_WORK_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_WORK_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_CLOUDSQL_WORK_QUEUE_TASK_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_CLOUD_RUN_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_CLOUD_RUN_NAME"
                      + value = "bedrock-9decd0-gcs-crawler"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_CLOUD_RUN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_DEFAULT_POLICY_ENABLED"
                      + value = "true"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_SCAN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_WORK_QUEUE_ID"
                      + value = "bedrock-9decd0-gcs-crawler-work-queue"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_WORK_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_WORK_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_WORK_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_GCS_WORK_QUEUE_TASK_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_CLOUD_RUN_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_CLOUD_RUN_NAME"
                      + value = "bedrock-9decd0-snowflake-crawler"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_CLOUD_RUN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_DATABASE_PAGE_SIZE"
                      + value = "100"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_DEFAULT_POLICY_ENABLED"
                      + value = "false"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_SCAN_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_SCHEMA_PAGE_SIZE"
                      + value = "100"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_TABLE_PAGE_SIZE"
                      + value = "100"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_WORK_QUEUE_ID"
                      + value = "bedrock-9decd0-snowflake-crawler-work-queue"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_WORK_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_WORK_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_WORK_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }
                  + env {
                      + name  = "SCHED_PLATFORM_SNOWFLAKE_WORK_QUEUE_TASK_URL"
                      + value = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "128Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.bedrock_security.google_cloud_run_service.snowflake_crawler will be created
+ resource "google_cloud_run_service" "snowflake_crawler" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "bedrock-9decd0-snowflake-crawler"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"     = "250"
                  + "autoscaling.knative.dev/minScale"     = "0"
                  + "run.googleapis.com/startup-cpu-boost" = "false"
                  + "run.googleapis.com/startupProbeType"  = "Default"
                }
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = 1
              + service_account_name  = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
              + serving_state         = (known after apply)
              + timeout_seconds       = 599

              + containers {
                  + image = "gcr.io/symmetric-flag-392720/gcp_crawler_test"
                  + name  = (known after apply)

                  + env {
                      + name  = "CRAWL_CLOUD"
                      + value = "gcp"
                    }
                  + env {
                      + name  = "CRAWL_DATABASE_TABLE"
                      + value = "snowflake"
                    }
                  + env {
                      + name  = "CRAWL_GCP_AWS_HAWKEYE_ROLE_ARN"
                      + value = "arn:aws:iam::372065445367:role/bedrock-aws-role-gcp-gcptestcust1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_ID"
                      + value = "bedrock-9decd0-classification-work-queue"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }
                  + env {
                      + name  = "CRAWL_GCP_CLASS_QUEUE_TASK_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CRAWL_GCP_DYN_PATH_TABLE"
                      + value = "gcptestcust1-pth-table"
                    }
                  + env {
                      + name  = "CRAWL_GCP_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_ID"
                      + value = "bedrock-9decd0-snowflake-crawler-work-queue"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_LOCATION"
                      + value = "us-central1"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_PROJECT_ID"
                      + value = "devesh-atlantis-test"
                    }
                  + env {
                      + name  = "CRAWL_GCP_WORK_QUEUE_SA_EMAIL"
                      + value = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "256Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.bedrock_security.google_cloud_scheduler_job.scheduler_time_trigger will be created
+ resource "google_cloud_scheduler_job" "scheduler_time_trigger" {
      + description = "Periodic job to trigger the scheduler to run"
      + id          = (known after apply)
      + name        = "bedrock-9decd0-scheduler-cron-job"
      + paused      = (known after apply)
      + project     = (known after apply)
      + region      = (known after apply)
      + schedule    = "*/15 * * * *"
      + state       = (known after apply)
      + time_zone   = "Etc/UTC"

      + http_target {
          + body        = "eyJtZXNzYWdlIjp7ImF0dHJpYnV0ZXMiOnsiQmVkTXNnVHlwIjoiQmVkU2NoZWRQZXJNc2cifX19"
          + http_method = "POST"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
            }
        }

      + retry_config {
          + max_backoff_duration = "60s"
          + max_doublings        = 3
          + max_retry_duration   = "300s"
          + min_backoff_duration = "1s"
          + retry_count          = 5
        }
    }

  # module.bedrock_security.google_cloud_tasks_queue.bigquery_crawler_work_queue will be created
+ resource "google_cloud_tasks_queue" "bigquery_crawler_work_queue" {
      + id       = (known after apply)
      + location = "us-central1"
      + name     = "bedrock-9decd0-bigquery-crawler-work-queue"
      + project  = (known after apply)

      + rate_limits {
          + max_burst_size            = (known after apply)
          + max_concurrent_dispatches = 10
          + max_dispatches_per_second = 10
        }

      + retry_config {
          + max_attempts       = 5
          + max_backoff        = "60s"
          + max_doublings      = 3
          + max_retry_duration = "140s"
          + min_backoff        = "5s"
        }
    }

  # module.bedrock_security.google_cloud_tasks_queue.classification_work_queue will be created
+ resource "google_cloud_tasks_queue" "classification_work_queue" {
      + id       = (known after apply)
      + location = "us-central1"
      + name     = "bedrock-9decd0-classification-work-queue"
      + project  = (known after apply)

      + rate_limits {
          + max_burst_size            = (known after apply)
          + max_concurrent_dispatches = 500
          + max_dispatches_per_second = 500
        }

      + retry_config {
          + max_attempts       = 1
          + max_backoff        = (known after apply)
          + max_doublings      = (known after apply)
          + max_retry_duration = (known after apply)
          + min_backoff        = (known after apply)
        }
    }

  # module.bedrock_security.google_cloud_tasks_queue.cloudsql_crawler_work_queue will be created
+ resource "google_cloud_tasks_queue" "cloudsql_crawler_work_queue" {
      + id       = (known after apply)
      + location = "us-central1"
      + name     = "bedrock-9decd0-cloudsql-crawler-work-queue"
      + project  = (known after apply)

      + rate_limits {
          + max_burst_size            = (known after apply)
          + max_concurrent_dispatches = 10
          + max_dispatches_per_second = 10
        }

      + retry_config {
          + max_attempts       = 5
          + max_backoff        = "60s"
          + max_doublings      = 3
          + max_retry_duration = "140s"
          + min_backoff        = "5s"
        }
    }

  # module.bedrock_security.google_cloud_tasks_queue.gcs_crawler_work_queue will be created
+ resource "google_cloud_tasks_queue" "gcs_crawler_work_queue" {
      + id       = (known after apply)
      + location = "us-central1"
      + name     = "bedrock-9decd0-gcs-crawler-work-queue"
      + project  = (known after apply)

      + rate_limits {
          + max_burst_size            = (known after apply)
          + max_concurrent_dispatches = 250
          + max_dispatches_per_second = 250
        }

      + retry_config {
          + max_attempts       = 5
          + max_backoff        = "60s"
          + max_doublings      = 3
          + max_retry_duration = "300s"
          + min_backoff        = "5s"
        }
    }

  # module.bedrock_security.google_cloud_tasks_queue.scheduler_queue will be created
+ resource "google_cloud_tasks_queue" "scheduler_queue" {
      + id       = (known after apply)
      + location = "us-central1"
      + name     = "bedrock-9decd0-scheduler-queue"
      + project  = (known after apply)

      + rate_limits {
          + max_burst_size            = (known after apply)
          + max_concurrent_dispatches = 10
          + max_dispatches_per_second = 10
        }

      + retry_config {
          + max_attempts       = 5
          + max_backoff        = "60s"
          + max_doublings      = 3
          + max_retry_duration = "300s"
          + min_backoff        = "1s"
        }
    }

  # module.bedrock_security.google_cloud_tasks_queue.snowflake_crawler_work_queue will be created
+ resource "google_cloud_tasks_queue" "snowflake_crawler_work_queue" {
      + id       = (known after apply)
      + location = "us-central1"
      + name     = "bedrock-9decd0-snowflake-crawler-work-queue"
      + project  = (known after apply)

      + rate_limits {
          + max_burst_size            = (known after apply)
          + max_concurrent_dispatches = 100
          + max_dispatches_per_second = 100
        }

      + retry_config {
          + max_attempts       = 5
          + max_backoff        = "60s"
          + max_doublings      = 3
          + max_retry_duration = "300s"
          + min_backoff        = "5s"
        }
    }

  # module.bedrock_security.google_cloudfunctions_function.terraform_status will be created
+ resource "google_cloudfunctions_function" "terraform_status" {
      + available_memory_mb           = 128
      + description                   = "Write the output of the Terraform status back to the S3 Bucket in AWS"
      + docker_registry               = (known after apply)
      + entry_point                   = "handler"
      + environment_variables         = {
          + "AWS_BUCKET_NAME"        = "e4d91e50-dc06-4f35-9081-38b21c3af242-us-west-2"
          + "AWS_ROLE_ARN"           = "arn:aws:iam::372065445367:role/bedrock-aws-role-gcp-gcptestcust1"
          + "BEDROCK_TFSTATE_BUCKET" = "bedrock-terraform-state-bucket-devesh-atlantis-test"
          + "CUSTOMER_KEY"           = "gcptestcust1"
          + "PROJECT_ID"             = "devesh-atlantis-test"
          + "WORKSPACE"              = "default"
        }
      + https_trigger_security_level  = (known after apply)
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = (known after apply)
      + name                          = "bedrock-9decd0-terraform-status"
      + project                       = (known after apply)
      + region                        = "us-central1"
      + runtime                       = "python39"
      + service_account_email         = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
      + source_archive_bucket         = "f9ce9e68-c2ff-467c-b7d4-8ce488d986e5"
      + source_archive_object         = "terraform_cloud_function.zip"
      + status                        = (known after apply)
      + timeout                       = 60
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = "google.pubsub.topic.publish"
          + resource   = "projects/devesh-atlantis-test/topics/bedrock-9decd0-terraform-status-queue"
        }
    }

  # module.bedrock_security.google_cloudfunctions_function.web_identity will be created
+ resource "google_cloudfunctions_function" "web_identity" {
      + available_memory_mb           = 128
      + description                   = "Bedrock Web Identity Client (creates a temporary AWS credential for the customer)"
      + docker_registry               = (known after apply)
      + entry_point                   = "handler"
      + environment_variables         = {
          + "CUSTOMER_KEY"  = "gcptestcust1"
          + "PROVIDER_NAME" = "gcp"
          + "UNIQUE_ID"     = "109296740294226851611"
        }
      + https_trigger_security_level  = (known after apply)
      + https_trigger_url             = (known after apply)
      + id                            = (known after apply)
      + ingress_settings              = "ALLOW_ALL"
      + max_instances                 = (known after apply)
      + name                          = "bedrock-9decd0-web-identity"
      + project                       = (known after apply)
      + region                        = "us-central1"
      + runtime                       = "python39"
      + service_account_email         = "bedrock-sa-crawler@devesh-atlantis-test.iam.gserviceaccount.com"
      + source_archive_bucket         = "f9ce9e68-c2ff-467c-b7d4-8ce488d986e5"
      + source_archive_object         = "web_identity_cloud_function.zip"
      + status                        = (known after apply)
      + timeout                       = 60
      + vpc_connector_egress_settings = (known after apply)

      + event_trigger {
          + event_type = "google.pubsub.topic.publish"
          + resource   = "projects/devesh-atlantis-test/topics/bedrock-9decd0-web-identity-queue"
        }
    }

  # module.bedrock_security.google_project_iam_custom_role.service_bedrock_role will be created
+ resource "google_project_iam_custom_role" "service_bedrock_role" {
      + deleted     = (known after apply)
      + description = "A custom role for Bedrock Security Service Account"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "firebasestorage.buckets.get",
          + "resourcemanager.projects.get",
          + "storage.buckets.get",
          + "storage.buckets.listEffectiveTags",
          + "storage.buckets.listTagBindings",
        ]
      + project     = (known after apply)
      + role_id     = "serviceBedrockRole_37a8ee"
      + stage       = "GA"
      + title       = "Service Bedrock Role"
    }

  # module.bedrock_security.google_project_iam_member.bedrock_service_custom_role will be created
+ resource "google_project_iam_member" "bedrock_service_custom_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "devesh-atlantis-test"
      + role    = (known after apply)
    }

  # module.bedrock_security.google_project_iam_member.bedrock_service_predefined_roles["roles/bigquery.metadataViewer"] will be created
+ resource "google_project_iam_member" "bedrock_service_predefined_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "devesh-atlantis-test"
      + role    = "roles/bigquery.metadataViewer"
    }

  # module.bedrock_security.google_project_iam_member.bedrock_service_predefined_roles["roles/cloudsql.viewer"] will be created
+ resource "google_project_iam_member" "bedrock_service_predefined_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "devesh-atlantis-test"
      + role    = "roles/cloudsql.viewer"
    }

  # module.bedrock_security.google_project_iam_member.bedrock_service_predefined_roles["roles/datastore.viewer"] will be created
+ resource "google_project_iam_member" "bedrock_service_predefined_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "devesh-atlantis-test"
      + role    = "roles/datastore.viewer"
    }

  # module.bedrock_security.google_project_iam_member.bedrock_service_predefined_roles["roles/iam.securityReviewer"] will be created
+ resource "google_project_iam_member" "bedrock_service_predefined_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "devesh-atlantis-test"
      + role    = "roles/iam.securityReviewer"
    }

  # module.bedrock_security.google_project_iam_member.bedrock_service_predefined_roles["roles/iam.serviceAccountViewer"] will be created
+ resource "google_project_iam_member" "bedrock_service_predefined_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "devesh-atlantis-test"
      + role    = "roles/iam.serviceAccountViewer"
    }

  # module.bedrock_security.google_project_iam_member.bedrock_service_predefined_roles["roles/securitycenter.adminViewer"] will be created
+ resource "google_project_iam_member" "bedrock_service_predefined_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "devesh-atlantis-test"
      + role    = "roles/securitycenter.adminViewer"
    }

  # module.bedrock_security.google_project_iam_member.bedrock_service_predefined_roles["roles/securitycenter.assetsViewer"] will be created
+ resource "google_project_iam_member" "bedrock_service_predefined_roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "devesh-atlantis-test"
      + role    = "roles/securitycenter.assetsViewer"
    }

  # module.bedrock_security.google_pubsub_subscription.terraform_status_subscription will be created
+ resource "google_pubsub_subscription" "terraform_status_subscription" {
      + ack_deadline_seconds       = 61
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "bedrock-9decd0-terraform-status-subscription"
      + project                    = (known after apply)
      + topic                      = "bedrock-9decd0-terraform-status-queue"
    }

  # module.bedrock_security.google_pubsub_subscription.web_identity_subscription will be created
+ resource "google_pubsub_subscription" "web_identity_subscription" {
      + ack_deadline_seconds       = 61
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "bedrock-9decd0-web-identity-subscription"
      + project                    = (known after apply)
      + topic                      = "bedrock-9decd0-web-identity-queue"
    }

  # module.bedrock_security.google_pubsub_topic.terraform_status_queue will be created
+ resource "google_pubsub_topic" "terraform_status_queue" {
      + id      = (known after apply)
      + name    = "bedrock-9decd0-terraform-status-queue"
      + project = (known after apply)
    }

  # module.bedrock_security.google_pubsub_topic.web_identity_queue will be created
+ resource "google_pubsub_topic" "web_identity_queue" {
      + id      = (known after apply)
      + name    = "bedrock-9decd0-web-identity-queue"
      + project = (known after apply)
    }

  # module.bedrock_security.google_service_account.service_bedrock_security will be created
+ resource "google_service_account" "service_bedrock_security" {
      + account_id = "service-bedrock-security"
      + disabled   = false
      + email      = (known after apply)
      + id         = (known after apply)
      + member     = (known after apply)
      + name       = (known after apply)
      + project    = (known after apply)
      + unique_id  = (known after apply)
    }

  # module.bedrock_security.google_service_account_iam_binding.cspm_workload_assignment[0] will be created
+ resource "google_service_account_iam_binding" "cspm_workload_assignment" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + members            = [
          + "principalSet://iam.googleapis.com/projects/125087486294/locations/global/workloadIdentityPools/bedrockidentitypool/*",
        ]
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

Plan: 30 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://107.3.173.12/lock?id=devesh-bedrock%252Fatlantis-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 30 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`